In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [3]:
df['col2'].nunique() #no. of unique values

3

In [4]:
df['col2'].value_counts() #no. of occurences

444    2
555    1
666    1
Name: col2, dtype: int64

In [6]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [7]:
def times2(x):
    return x*2

In [9]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [10]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [11]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [12]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [13]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [15]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# PIVOT TABLES

In [18]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [19]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [20]:
df.pivot_table(values= 'D', index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Ouput

In [21]:
pwd

'C:\\Work_NN\\PythonDirectory'

In [25]:
df=pd.read_csv('example.csv')

In [33]:
df.to_csv('My_output.csv')

In [34]:
pd.read_csv('My_output.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [37]:
df.to_csv('My_output.csv',index=False)

In [38]:
pd.read_csv('My_output.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [39]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\nnaaz\appdata\local\continuum\anaconda3\lib\site-packages

You are using pip version 9.0.1, however version 10.0.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [43]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

C:\Users\nNaaz\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\util\_decorators.py:118: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [46]:
df.to_excel('naushi_excel.xlsx',sheet_name='newsheet')

In [47]:
pd.read_excel('naushi_excel.xlsx',sheetname='newsheet')

C:\Users\nNaaz\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\util\_decorators.py:118: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [50]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [51]:
type(data)

list

In [54]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

# SQL

In [60]:
from sqlalchemy import create_engine

In [61]:
engine= create_engine('sqlite:///:memory:') #very small sql lite engine is created in the memory temporary

In [66]:
df.to_sql(['my_table'],engine)

AttributeError: 'list' object has no attribute 'to_sql'